TITLE                                          = "USB Device Firmware Upgrade";

GROUP_DEVICE_TITLE                             = "Device";
GROUP_DEVICE_LABEL_MANUFACTURER                = "Manufacturer:";
GROUP_DEVICE_LABEL_PRODUCT                     = "Product:";
GROUP_DEVICE_LABEL_VID_PID                     = "VID/PID:";
GROUP_DEVICE_LABEL_SERIAL_NUMBER               = "Serial Number:";
GROUP_DEVICE_LABEL_FIRMWARE_VERSION            = "Current Firmware:";

GROUP_FIRMWARE_TITLE                           = "Firmware";
GROUP_FIRMWARE_BUTTON_BROWSE                   = "Browse...";

GROUP_UPGRADE_TITLE                            = "Upgrade";
GROUP_UPGRADE_STATUSTEXT_IDLE                  = "";
GROUP_UPGRADE_STATUSTEXT_OPEN_DEVICE           = "Device opened.";
GROUP_UPGRADE_STATUSTEXT_READY                 = "Ready for firmware update.";
/* NOTE: The strings $CurVer$ and $NewVer$ are placeholders for the current and new firmware
         version and must not be changed! They must be present in every translation. */
GROUP_UPGRADE_STATUSTEXT_READY_VERSION         = "Ready for firmware update from version $CurVer$ to $NewVer$.";
GROUP_UPGRADE_STATUSTEXT_INIT                  = "Initializing...";
GROUP_UPGRADE_STATUSTEXT_ENTER_DFU             = "Entering upgrade mode...";
GROUP_UPGRADE_STATUSTEXT_IN_PROGRESS           = "Upgrading firmware...";
/* NOTE: The strings $CurrentBytes$ and $TotalBytes$ are placeholders for the number of
         already transferred and the number of total bytes to transfer. They must not 
         be changed! They must be present in every translation. */
GROUP_UPGRADE_STATUSTEXT_TRANSFER_PROGRESS     = "$CurrentBytes$ of $TotalBytes$ bytes transferred.";
GROUP_UPGRADE_STATUSTEXT_ENTER_APP             = "Starting firmware...";
GROUP_UPGRADE_STATUSTEXT_SUCCESS               = "Firmware upgrade finished successfully.";
GROUP_UPGRADE_STATUSTEXT_FAILED                = "Firmware upgrade failed!";
/* NOTE: The string $NewVer$ is a placeholder for the version of the new firmware and
         must not be changed! It must be present in every translation. */
GROUP_UPGRADE_STATUSTEXT_NOT_REQUIRED          = "The new firmware version is $NewVer$. The version of the firmware running in the device is identical or newer. No upgrade is required.";
GROUP_UPGRADE_STATUSTEXT_REPEAT_ON_ERROR       = "Another upgrade is required. The process will be repeated.";
GROUP_UPGRADE_BUTTON_START                     = "Start";

BUTTON_CLOSE                                   = "Exit";

MESSAGE_BOX_ERROR_TITLE                        = "Error";
MESSAGE_BOX_INFO_TITLE                         = "Note";
MESSAGE_BOX_BUTTON_YES                         = "Yes";
MESSAGE_BOX_BUTTON_NO                          = "No";

/* NOTE: The strings $Caller$, $Function$ and $ErrorCode$ are placeholders for error-dependent information
         and must not be changed! They must be present in every translation. */
ERROR_MESSAGE_COMMON                           = "$Caller$: Function $Function$ failed with error code $ErrorCode$.";
ERROR_MESSAGE_UPGRADE_FAILED                   = "The firmware upgrade has failed. To try again, disconnect the device, turn power off and on, and reconnect it.";
ERROR_MESSAGE_NO_FIRMWARE_FILE_AVAILABLE       = "No firmware is available for this device.";
ERROR_MESSAGE_OPEN_FIRMWARE_FILE_FAILED        = "Unable to open the specified firmware file.";
ERROR_MESSAGE_INVALID_FIRMWARE_FILE            = "The specified firmware file is invalid.";
ERROR_MESSAGE_READ_FIRMWARE_FILE_FAILED        = "Unable to read from the specified firmware file.";
ERROR_MESSAGE_NO_DEVICE                        = "No device found. Please plug in the device you want to upgrade.";
ERROR_MESSAGE_TOO_MANY_DEVICES                 = "More than one device found. Please plug in exactly one device.";

QUESTION_YESNO_CONFIRM_TO_ABORT                = "The firmware upgrade is currently running. The device could be damaged if you abort now. Do you really want to abort?";
QUESTION_YESNO_CONFIRM_TO_DOWNGRADE            = "The version of the firmware running in the device is identical or newer to the version to be downloaded. Do you want to continue?";
